true;       // встроенный литерал, обозначающий истину
'S';        // символ заглавной латинской буквы
5;          // просто целое число (int)
7ll;        // большое целое число (long long)
3.1416;     // просто рациональное число (double)
3.1416f;    // рациональное число с типом float
"Hello";    // литерал строки, строки мы пройдём чуть позже
float x;
char a = 'a';
char symbol = a;
char x = symbol + 5;        // Как думаете, рабочий ли это код? Если да, то чему равен x?
int a, step = 0, count = 1, b;
