#include <bitset>                       // содержит bitset
bitset<9> a, b(13), c;                  // b = 101100000
a[1] = a[3] = a[4] = a[7] = 1;          // a = 010110010
c = ~a;                                 // c = 101001101
c = a & b;                              // c = 000100000
c = a | b;                              // c = 111110010
c = a & ~b;                             // c = 010010010
c = a ^ b;                              // c = 111010010
cout << c.count() << " " << c.size() << " " << c[0] << " " << c[3];     // 5 9 1 0
